
/*
#LeetCode# Q0036 有效的数独
难度：中

判断一个9x9数独棋盘是否有效。只有填好的单元格需要按照以下规则进行验证：

每一行必须包含1-9的数字，且不重复。
每一列必须包含数字1-9不重复。
9个3x3子格的每个3x3子格必须包含数字1-9不重复的数字。

数独板可以被部分填充，其中空的单元格被填上'.'字。

Example 1:

Input:
[
  ["5","3",".",".","7",".",".",".","."],
  ["6",".",".","1","9","5",".",".","."],
  [".","9","8",".",".",".",".","6","."],
  ["8",".",".",".","6",".",".",".","3"],
  ["4",".",".","8",".","3",".",".","1"],
  ["7",".",".",".","2",".",".",".","6"],
  [".","6",".",".",".",".","2","8","."],
  [".",".",".","4","1","9",".",".","5"],
  [".",".",".",".","8",".",".","7","9"]
]
Output: true
Example 2:

Input:
[
  ["8","3",".",".","7",".",".",".","."],
  ["6",".",".","1","9","5",".",".","."],
  [".","9","8",".",".",".",".","6","."],
  ["8",".",".",".","6",".",".",".","3"],
  ["4",".",".","8",".","3",".",".","1"],
  ["7",".",".",".","2",".",".",".","6"],
  [".","6",".",".",".",".","2","8","."],
  [".",".",".","4","1","9",".",".","5"],
  [".",".",".",".","8",".",".","7","9"]
]
Output: false
Explanation: Same as Example 1, except with the 5 in the top left corner being 
    modified to 8. Since there are two 8's in the top left 3x3 sub-box, it is invalid.

注意：
数独板（部分填空）可以有效，但不一定能解。
只有被填满的单元格需要根据上述规则进行验证。
给定的数独棋盘只包含数字1-9和字符'.'。
给定的棋盘大小总是9x9。

*/
#include "leetcode.h"

namespace q0036
{

template<typename T>
bool run_testcases() {
    T slt;

    return true;
}

class Solution {
public:
    void func();
};

} // namespace q0036
